// Block Scope (let/constant)
// เป็นการประการใช้ let กับ constant นิยามตัวแปรขึ้นมา แทนการใช้ var 
// เพราะ var สามารถมีข้อผิดพลาดเกิดขึ้นได้ เช่นทะลุขอบเขตของ {} 
// let ประการตัวแปรที่เปลี่ยนค่าได้ 
// constant ประกาศตัวแปรค่าคงที่

// การเขียนแบบเก่าแบบเดิม
// var x = 10
// if (x===10){
//     var y = 500 //ถูกมองเป็น global variable
//     console.log("yใน="+y);
// }
// console.log("yนอก="+y); //yนอก=500 มี2รอบ ปัญหาที่ขอบเขตทะลุขอบเขตปีกกา

// การเขียนแบบ let
// let x = 10
// let y = 50
// if (x===10){
//     let y = 500 
//     console.log("yใน="+y);
// }
// console.log("yนอก="+y); //yนอก=500 จะไม่แสดงเพราะ let

// การเขียนแบบ const

// const x = 10 //ถ้าจะให้เปลี่ยนได้ต้องใช้ let
// x = 100
// console.log(x);

let x = 10
x = 10000
console.log(x);